modules/admin/controllers/PostsController.php

    public function actionUpdate($p, $slug)
    {
        $_SESSION['pages'] = $p;
        $model = Posts::findOne(['slug' => $slug]);
---
SELECT * FROM `posts` WHERE `slug`='jalan-sehat-wal-afiat'

    protected function findModel($id)
    {
        if (($model = Posts::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `posts` WHERE `id`='1'