views/layouts/auth.php

use yii\helpers\Url;
use yii\widgets\Pjax;

$profile = Profile::findOne(['id' => 1]);
---
SELECT * FROM `profile` WHERE `id`=1