controllers/SiteController.php

    public function actionPosts($slug)
    {
        $cek = Pages::findOne(['slug' => $slug]);
---
SELECT * FROM `pages` WHERE `slug`='kegiatan'