views/site/index.php

SELECT * FROM `posts` WHERE `id_pages`=1
---
                <h3><?= $dataPages['name'] ?></h3>
            </div>
            <?php
            $posts = Posts::find()->where(['id_pages' => $dataPages['id']])->all();